cf/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВорд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыWord</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пролонгация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПролонгацияДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыРасчетовПоДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПретензионныйПорядок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПретензионныйПорядок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсудность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подсудность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьБезЗащиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УровниСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПролонгируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньПредоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ДокументыWord.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ДокументыWord</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДвоичныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Замена</Name>
							<Comment>Значит внутри документа нужно делать замены</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаменыВДокументахWord</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Макет</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбязательныеЗамены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстЗамены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтернетЗаказ_УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтернетЗаказ_СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтернетЗаказ_БанковскийСчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтернетЗаказ_Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксКНомеруДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РоссийскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НемецкийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id_Nr</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Steuernummer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EORI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Betriebsnummer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Aktenzeichen</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Registergericht</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Registereintragung</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКартинкиПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаимствоватьНумерациюИзБухгалтерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСистемыНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСистемНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonForms/ПечатьДокументовВорд/Ext/Form/Module.bsl
&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
	
	текДанные = Элементы.ВордДокументы.ТекущиеДанные;
	ДоступностьКнопок = текДанные <> Неопределено И текДанные.Картинка;
	
	Элементы.КнопкаОткрыть.Доступность 	= ДоступностьКнопок;
	Элементы.КнопкаПечать.Доступность 	= ДоступностьКнопок;
	
КонецПроцедуры


&НаСервере
Процедура УдалитьОдинокиеСтроки(Строка)
	
	// Обработаем по иерархии
	
	Удалить = Истина;
	Для Каждого ВложСтрока Из Строка.Строки Цикл УдалитьОдинокиеСтроки(ВложСтрока) КонецЦикла;
	
	// Удалим если строка одинока
	// или если удалил и теперь он единственный тогда сносим и себя
	
	Если	Не Строка.Строки.Количество() И 
			Строка.Родитель <> Неопределено И 
			Строка.Родитель.Строки.Количество() = 1 Тогда 
			
		Строка.Родитель.Строки.Удалить(Строка);КонецЕсли;
		
КонецПроцедуры
&НаСервере
Функция ПолучитьСамуюНизкуюСтроку(Строка)
	
	Возврат ?(Строка.Строки.Количество(), ПолучитьСамуюНизкуюСтроку(Строка.Строки[0]), Строка);
	
КонецФункции
&НаСервере
Процедура УбратьПромежутки(Дерево, Строка)
	
	// Выбрались на самый верх
	
	Если Строка.Родитель = Неопределено Тогда Возврат; КонецЕсли;
	
	// Поднимаемся выше
	
	Если Строка.Родитель.Строки.Количество() > 1 Тогда УбратьПромежутки(Дерево, Строка.Родитель); КонецЕсли;
	
	// Детей и отдаем родителям а сами ликвидируемся
	
	Попытка
		Если Строка.Родитель.Строки.Количество() = 1 Тогда Для Каждого ВложСтрока Из Строка.Строки Цикл 
			КонвертацияТипов.ПеренестиРодителяВДереве(Дерево, Строка.Родитель, ВложСтрока); КонецЦикла; КонецЕсли; Исключение КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПредставлениеСтрок(Строка)
	
	Если Строка.Строки.Количество() Тогда
		
		Если ЗначениеЗаполнено(Строка.ДокументВордПредставление) Тогда
			Строка.Представление = Строка.ДокументВордПредставление;
		
		ИначеЕсли ЗначениеЗаполнено(Строка.Организация) Тогда
			Строка.Представление = Строка.Организация;
			
		ИначеЕсли ЗначениеЗаполнено(Строка.Контрагент) Тогда
			Строка.Представление = "Контрагент: " + Строка.Контрагент;
			
		ИначеЕсли ЗначениеЗаполнено(Строка.Партнер) Тогда
			Строка.Представление = "Партнер: " + Строка.Партнер; КонецЕсли;
		
		Для Каждого вложСтрока Из Строка.Строки Цикл ИзменитьПредставлениеСтрок(вложСтрока); КонецЦикла; 
		
	Иначе
		
		КоличествоКартинок = КоличествоКартинок + 1;
		Строка.Картинка = ?(ЗначениеЗаполнено(Строка.Замена), 2, 1); КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	0 Картинка,
	|	Договор.Ссылка          	Договор,
	|	Договор.ЗначениеПоУмолчанию 	ПоУмолчанию,
	|	Договор.Организация			Организация,
	|	Договор.Организация			ОрганизацияЗначение,
	|	Договор.Владелец.Партнер		Партнер,
	|	Договор.Владелец 				Контрагент,
	|	Договор.Владелец 				КонтрагентЗначение,
	|	Док.Замена					Замена,
	|	Док.Ссылка					ДокументВорд,
	|	Представление(Док.Ссылка)	ДокументВордПредставление,
	|	Док.НомерСтроки - 1 		ИндексДокумента,
	|	Док.ИмяФайла				ИмяФайла,
	|	Док.ИмяФайла + "" к договору №"" + Договор.Наименование + "" от ("" + Договор.Организация.Наименование + "")"" Представление
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов Договор
	|
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ДокументыWord.ДвоичныеДанные Док
	|ПО
	|	Договор.ДокументВорд = Док.Ссылка
	|
	|ГДЕ ИСТИНА
	|" + ?(Параметры.Договор.Пустая(), 	"", "И Договор.Ссылка = &Договор") + "
	|" + ?(Параметры.Партнер.Пустая(), 		"", "И Договор.Владелец.Партнер = &Партнер") + "
	|" + ?(Параметры.Контрагент.Пустая(), 	"", "И Договор.Владелец 		= &Контрагент") + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент, Организация, ДокументВорд, ИмяФайла
	|");
	
	Запрос.УстановитьПараметр("Договор", 		Параметры.Договор);
	Запрос.УстановитьПараметр("Партнер", 			Параметры.Партнер);
	Запрос.УстановитьПараметр("Контрагент", 		Параметры.Контрагент);
	//Запрос.УстановитьПараметр("ДокументВорд", 		ДокументВорд);
	//Запрос.УстановитьПараметр("ИндексДокумента", 	ИндексДокумента);
	
	// Загрузим
	ВордДокументы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
	
	//Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	//
	//// Уберем одиноких
	//
	//Для Каждого Строка Из Дерево.Строки Цикл УдалитьОдинокиеСтроки(Строка); КонецЦикла;
	//
	//// Удадим промежуточные одинокие строки
	//
	////Для Каждого Строка Из Дерево.Строки Цикл УбратьПромежутки(Дерево, ПолучитьСамуюНизкуюСтроку(Строка)); КонецЦикла;
	//
	//// Меняем представления строк
	//Для Каждого Строка Из Дерево.Строки Цикл ИзменитьПредставлениеСтрок(Строка); КонецЦикла;
	//
	//// Положим на форму
	//
	//КонвертацияТипов.ЗагрузитьДеревоВДанныеФормыДерево(Дерево, ВордДокументы);
	
	
	//Запрос = Новый Запрос("
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	0 Картинка,
	//|	Контр.ЗначениеПоУмолчанию 	ПоУмолчанию,
	//|	Контр.Организация			Организация,
	//|	Контр.Организация			ОрганизацияЗначение,
	//|	Контр.Ссылка.Партнер		Партнер,
	//|	Контр.Ссылка 				Контрагент,
	//|	Контр.Ссылка 				КонтрагентЗначение,
	//|	Док.Замена					Замена,
	//|	Док.Ссылка					ДокументВорд,
	//|	Представление(Док.Ссылка)	ДокументВордПредставление,
	//|	Док.НомерСтроки - 1 		ИндексДокумента,
	//|	Док.ИмяФайла				ИмяФайла,
	//|	Док.ИмяФайла + "" к договору №"" + Контр.НомерДоговора + "" от ("" + Контр.Организация.Наименование + "")"" Представление
	//|ИЗ
	//|	Справочник.Контрагенты.Организации Контр
	//|
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|	Справочник.ДокументыWord.ДвоичныеДанные Док
	//|ПО
	//|	Контр.ДокументВорд = Док.Ссылка
	//|
	//|ГДЕ ИСТИНА
	//|" + ?(Параметры.Организация.Пустая(), 	"", "И Контр.Организация 	= &Организация") + "
	//|" + ?(Параметры.Партнер.Пустая(), 		"", "И Контр.Ссылка.Партнер = &Партнер") + "
	//|" + ?(Параметры.Контрагент.Пустая(), 	"", "И Контр.Ссылка 		= &Контрагент") + "
	////|" + ?(Параметры.ДокументВорд 	= Неопределено, "", "И Док.ДокументВорд 	= &ДокументВорд") + "
	////|" + ?(ИндексДокумента 	= Неопределено, "", "И Док.НомерСтроки - 1 	= &ИндексДокумента") + "
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Партнер, Контрагент, Организация, ДокументВорд, ИмяФайла
	//|
	//|ИТОГИ МАКСИМУМ(Представление), МАКСИМУМ(ПоУмолчанию), МАКСИМУМ(ДокументВорд), МАКСИМУМ(Замена) , МАКСИМУМ(КонтрагентЗначение), МАКСИМУМ(ОрганизацияЗначение) ПО
	//|	Партнер, Контрагент, Организация, ДокументВорд
	//|");
	//
	//Запрос.УстановитьПараметр("Организация", 		Параметры.Организация);
	//Запрос.УстановитьПараметр("Партнер", 			Параметры.Партнер);
	//Запрос.УстановитьПараметр("Контрагент", 		Параметры.Контрагент);
	////Запрос.УстановитьПараметр("ДокументВорд", 		ДокументВорд);
	////Запрос.УстановитьПараметр("ИндексДокумента", 	ИндексДокумента);
	//
	//// Загрузим
	//
	//Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	//
	//// Уберем одиноких
	//
	//Для Каждого Строка Из Дерево.Строки Цикл УдалитьОдинокиеСтроки(Строка); КонецЦикла;
	//
	//// Удадим промежуточные одинокие строки
	//
	////Для Каждого Строка Из Дерево.Строки Цикл УбратьПромежутки(Дерево, ПолучитьСамуюНизкуюСтроку(Строка)); КонецЦикла;
	//
	//// Меняем представления строк
	//Для Каждого Строка Из Дерево.Строки Цикл ИзменитьПредставлениеСтрок(Строка); КонецЦикла;
	//
	//// Положим на форму
	//
	//КонвертацияТипов.ЗагрузитьДеревоВДанныеФормыДерево(Дерево, ВордДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВордДокументыПриАктивизацииСтроки(Элемент)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКнопка(Команда)
	
	текДанные = Элементы.ВордДокументы.ТекущиеДанные;
	ДиалогиСПользователем.ОткрытьДокументВордДляПросмотра(текДанные.ДокументВорд, текДанные.ИндексДокумента, Новый Структура("Организация, Контрагент, Партнер, ИндексДоговора", текДанные.ОрганизацияЗначение, текДанные.КонтрагентЗначение, текДанные.Партнер, текДанные.ИндексДокумента));
	
КонецПроцедуры
&НаКлиенте
Процедура ПечатьКнопка(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВордДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	текДанные 				= Элементы.ВордДокументы.ТекущиеДанные;
	
	Если текДанные.Картинка Тогда
		
		ДиалогиСПользователем.ОткрытьДокументВордДляПросмотра(текДанные.ДокументВорд, текДанные.ИндексДокумента, Новый Структура("Организация, Контрагент, Партнер, ИндексДоговора", текДанные.ОрганизацияЗначение, текДанные.КонтрагентЗначение, текДанные.Партнер, текДанные.ИндексДокумента));
		
	ИначеЕсли Не ПустаяСтрока(текДанные.ДокументВордПредставление) Тогда
		
		ОткрытьФорму("Справочник.ДокументыWord.ФормаОбъекта", Новый Структура("Ключ", текДанные.ДокументВорд));
		
	ИначеЕсли Не ПустаяСтрока(текДанные.Организация) Тогда
		
		ОткрытьФорму("Справочник.Организации.ФормаОбъекта", Новый Структура("Ключ", текДанные.Организация));
		
	ИначеЕсли Не ПустаяСтрока(текДанные.Контрагент) Тогда
		
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("Ключ", текДанные.Контрагент));
		
	ИначеЕсли Не ПустаяСтрока(текДанные.Партнер) Тогда
		
		ОткрытьФорму("Справочник.Партнеры.ФормаОбъекта", Новый Структура("Ключ", текДанные.Партнер));
		
	Иначе СтандартнаяОбработка = Истина; КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ=Истина;
	
	Если ВордДокументы.Количество()=0  Тогда
		
		ПоказатьПредупреждение(,"Нет прикрепленных договоров к контрагенту!",,"Сообщить!");
		
	Иначе
		
		Для Каждого ТекДанные из ВордДокументы Цикл
			структураПеременных = ПолучитьСтруктуруПеременныхДляДоговора(ТекДанные.Договор);
			ДиалогиСПользователем.ОткрытьДокументВордДляПросмотра(текДанные.ДокументВорд, текДанные.ИндексДокумента, структураПеременных); 
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПеременныхДляДоговора(Договор)
	
	//Получим все необходимые данные для договора
	
	Контрагент=Договор.Владелец;
	Партнер=Договор.Владелец.Партнер;
	Организация=Договор.Организация;
	
	
	Струк = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Контрагент, ТекущаяДата());
	Струк.Вставить("Банк",Строка(Струк.Банк));
	
	Струк.Вставить("Организация",Организация);
	Струк.Вставить("Партнер",Партнер);
	Струк.Вставить("Контрагент",Контрагент);
	
	Струк.Вставить("ТекущаяДата",ТекущаяДата());
	Струк.Вставить("НомерДоговора",Договор.Наименование);
	Струк.Вставить("ДатаНачала",Формат(Договор.ДатаНачала,"ДЛФ=DD"));
	Струк.Вставить("ПолноеНаименованиеОрганизации",Организация.НаименованиеПолное);
	Струк.Вставить("ПолноеНаименованиеКонтрагента",Контрагент.НаименованиеПолное);
	
	Струк.Вставить("ВЛице",Контрагент.ВЛице);
	Струк.Вставить("НаОсновании",Контрагент.НаОсновании);
	Струк.Вставить("Подпись",Контрагент.Подпись);
	Струк.Вставить("Должность",Контрагент.ПодписьДолжность);
	
	Струк.Вставить("Телефон",ФормированиеПечатныхФорм.ПолучитьТелефонОрганизацииКонтрагента(Контрагент));
	Струк.Вставить("ТелефонОрганизации",ФормированиеПечатныхФорм.ПолучитьТелефонОрганизацииКонтрагента(Организация));
	
	Струк.Вставить("ДатаОкончания",Формат(Договор.ДатаОкончания,"ДЛФ=DD"));
	
	Струк.Вставить("СокрНаименование",Контрагент.СокрНаименование);
	Струк.Вставить("Город",Контрагент.Город.Наименование);
	Струк.Вставить("ГородДоставки",Договор.ГородДоставки.НаименованиеВДательномПадеже);
	
	Струк.Вставить("ОтсрочкаБанковскихДней",КонвертацияТипов.ПолучитьКоличествоДнейПрописью(Контрагент.ДнейОтсрочки,"банковского дня, банковских дней", Истина));
	Струк.Вставить("ДнейОтсрочки",Контрагент.ДнейОтсрочки);
	
	Струк.Вставить("НаименованиеОрганизации",Организация.Наименование);
	
	
	Струк2 = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Организация, ТекущаяДата());
	Струк.Вставить("ИННОрганизации",Струк2.ИНН);
	Струк.Вставить("КППОрганизации",Струк2.КПП);
	Струк.Вставить("НомерСчетаОрганизации",Струк2.НомерСчета);
	Струк.Вставить("КоррСчетОрганизации",Струк2.КоррСчет);
	Струк.Вставить("БИКОрганизации",Струк2.БИК);
	Струк.Вставить("БанкОрганизации",Строка(Струк2.Банк));
	Струк.Вставить("ЮридическийАдресОрганизации",Струк2.ЮридическийАдрес);
	Струк.Вставить("ФактическийАдресОрганизации",Струк2.ФактическийАдрес);
	
	
	Струк.Вставить("СуммаВМесяц",Контрагент.ОтгрузкаНеМенее);
	//Струк.Вставить("Территория",ДиалогиСПользователямиСервер.ПолучитьТерриториюПартнераСтр(Контрагент));
	Струк.Вставить("Территория", Контрагент.ОсновнойРегион.Наименование);
	Струк.Вставить("Преамбула",?(Найти(Строка(Организация), "Кукушкина"),
"в лице  Кукушкиной Ольги Валентиновны, действующей на основании Свидетельства о государственной регистрации серия 78 № 003446763 от 22.12.2004г",
"в лице  Генерального директора Кукушкиной Ольги Валентиновны, действующего на основании Устава"));

	Струк.Вставить("ПечататьБезЗащиты",Договор.ПечататьБезЗащиты);

	Струк.Вставить("ЭлПочтаКонтрагента",Струк.ЭлПочта);
	Струк.Вставить("ЭлПочтаОрганизации",Струк2.ЭлПочта);
   Возврат Струк;
КонецФункции
